//*****************************************************************************
//
//     モードベースの処理[basemode.cpp]
//     Auther:Hodaka Niwa
//
//*****************************************************************************
#include "basemode.h"
#include "map.h"
#include "cameraManager.h"
#include "modelcreate.h"

//*****************************************************************************
//    マクロ定義
//*****************************************************************************

//*****************************************************************************
//    静的メンバ変数宣言
//*****************************************************************************

//=============================================================================
//    コンストラクタ
//=============================================================================
CBasemode::CBasemode()
{
	// 各種値のクリア
	m_pMap = NULL;             // マップクラスへのポインタ
	m_pCameraManager = NULL;   // カメラ管轄クラスへのポインタ
	m_pModelCreate = NULL;     // モデル管轄クラスへのポインタ
}

//=============================================================================
//    デストラクタ
//=============================================================================
CBasemode::~CBasemode()
{

}

//=============================================================================
//    終了処理
//=============================================================================
void CBasemode::Uninit(void)
{
	// マップの破棄
	if (m_pMap != NULL)
	{
		m_pMap->Uninit();
		delete m_pMap;
		m_pMap = NULL;
	}

	// カメラ管轄クラスの破棄
	if (m_pCameraManager != NULL)
	{
		m_pCameraManager->Uninit();
		delete m_pCameraManager;
		m_pCameraManager = NULL;
	}

	// モデル管轄クラスの破棄
	if (m_pModelCreate != NULL)
	{
		m_pModelCreate->Uninit();
		delete m_pModelCreate;
		m_pModelCreate = NULL;
	}
}


//=============================================================================
//    マップクラスへのポインタを設定する
//=============================================================================
void CBasemode::SetMap(CMap *pMap)
{
	m_pMap = pMap;
}

//=============================================================================
//    カメラ管轄クラスへのポインタを設定する
//=============================================================================
void CBasemode::SetCameraManager(CCameraManager *pCameraManager)
{
	m_pCameraManager = pCameraManager;
}

//=============================================================================
//    モデル管轄クラスへのポインタを設定する
//=============================================================================
void CBasemode::SetModelCreate(CModelCreate *pModelCreate)
{
	m_pModelCreate = pModelCreate;
}

//=============================================================================
//    マップクラスへのポインタを取得する
//=============================================================================
CMap *CBasemode::GetMap(void)
{
	return m_pMap;
}

//=============================================================================
//    カメラ管轄クラスへのポインタを取得する
//=============================================================================
CCameraManager *CBasemode::GetCameraManager(void)
{
	return m_pCameraManager;
}

//=============================================================================
//    モデル管轄クラスへのポインタを取得する
//=============================================================================
CModelCreate *CBasemode::GetModelCreate(void)
{
	return m_pModelCreate;
}